Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 100, 100, 8)       224       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 50, 50, 8)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 50, 50, 8)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 50, 50, 8)         584       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 25, 25, 8)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 25, 25, 16)        1168      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 13, 13, 16)        0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 2704)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 29)                78445     
=================================================================
Total params: 80,421
Trainable params: 80,421
Non-trainable params: 0
_________________________________________________________________
