Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 100, 100, 8)       224       
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 50, 50, 8)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 50, 50, 8)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 50, 50, 8)         584       
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 25, 25, 8)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 25, 25, 16)        1168      
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 13, 13, 16)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 13, 13, 32)        4640      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 7, 7, 32)          0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 1568)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 29)                45501     
=================================================================
Total params: 52,117
Trainable params: 52,117
Non-trainable params: 0
_________________________________________________________________
